# SegmentLengthDimensionsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..SegmentLengthDimensionsEnabled Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies if any segment length dimensions will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool SegmentLengthDimensionsEnabled { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthDimensionsEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SegmentLengthDimensionsEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace